# GetAllBuiltInParameters Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterUtils..::..GetAllBuiltInParameters Method
ParameterUtils Class See Also
---
Gets the identifiers of all built-in parameters.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public static IList<ForgeTypeId> GetAllBuiltInParameters()
```

Visual Basic
---
```text
Public Shared Function GetAllBuiltInParameters As IList(Of ForgeTypeId)
```

Visual C++
---
```text
public:
static IList<ForgeTypeId^>^ GetAllBuiltInParameters()
```

# ### Return Value
The built-in parameter identifiers.
# See Also
ParameterUtils Class
Autodesk.Revit.DB Namespace